{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<UNK>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<SEP>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<MASK>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "<CLS>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "<UNK>",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "vocab": {
      "<UNK>": 0,
      "<SEP>": 1,
      "<MASK>": 2,
      "<CLS>": 3,
      "+": 4,
      ",": 5,
      ".": 6,
      "1": 7,
      "2": 8,
      "A": 9,
      "B": 10,
      "C": 11,
      "D": 12,
      "E": 13,
      "F": 14,
      "G": 15,
      "H": 16,
      "I": 17,
      "J": 18,
      "K": 19,
      "L": 20,
      "M": 21,
      "N": 22,
      "O": 23,
      "P": 24,
      "Q": 25,
      "R": 26,
      "S": 27,
      "T": 28,
      "U": 29,
      "V": 30,
      "W": 31,
      "X": 32,
      "Y": 33,
      "_": 34,
      "`": 35,
      "a": 36,
      "b": 37,
      "c": 38,
      "d": 39,
      "e": 40,
      "i": 41,
      "l": 42,
      "m": 43,
      "n": 44,
      "o": 45,
      "p": 46,
      "r": 47,
      "s": 48,
      "t": 49,
      "u": 50,
      "w": 51,
      "_T": 52,
      "AC": 53,
      "_TAC": 54,
      "P_TAC": 55,
      "MP_TAC": 56,
      "IS": 57,
      "W_TAC": 58,
      "AS": 59,
      "IMP_TAC": 60,
      "SIMP_TAC": 61,
      "RW_TAC": 62,
      "CH": 63,
      "RI": 64,
      "RE": 65,
      "ET": 66,
      "M_": 67,
      "ASM_": 68,
      "E_TAC": 69,
      "REW": 70,
      "RIT": 71,
      "REWRIT": 72,
      "REWRITE_TAC": 73,
      "DIS": 74,
      "DISCH": 75,
      "MET": 76,
      "IS_TAC": 77,
      "METIS_TAC": 78,
      "AT": 79,
      "LL": 80,
      "SU": 81,
      "EN": 82,
      "DISCH_TAC": 83,
      "ON": 84,
      "ST": 85,
      "MAT": 86,
      "CH_": 87,
      "MATCH_": 88,
      "MATCH_MP_TAC": 89,
      "ASSU": 90,
      "ASSUM": 91,
      "FU": 92,
      "_SIMP_TAC": 93,
      "LL_SIMP_TAC": 94,
      "FULL_SIMP_TAC": 95,
      "NO": 96,
      "KNO": 97,
      "KNOW_TAC": 98,
      "_ASSUM": 99,
      "S_TAC": 100,
      "ASM_SIMP_TAC": 101,
      "EN_TAC": 102,
      "SET": 103,
      "STRI": 104,
      "SET_TAC": 105,
      "GEN_TAC": 106,
      "STRIP_TAC": 107,
      "EX": 108,
      "IST": 109,
      "EXIST": 110,
      "EXISTS_TAC": 111,
      "ASM_REWRITE_TAC": 112,
      "ASM_SET_TAC": 113,
      "E_": 114,
      "P_ASSUM": 115,
      "CE_": 116,
      "ONCE_": 117,
      "PE": 118,
      "AT_": 119,
      "REPE": 120,
      "REPEAT_": 121,
      "CON": 122,
      "LL_TAC": 123,
      "ALL_TAC": 124,
      "PO": 125,
      "POP_ASSUM": 126,
      "Q_TAC": 127,
      "_TH": 128,
      "_THEN": 129,
      "J_TAC": 130,
      "CONJ_TAC": 131,
      "ONCE_REWRITE_TAC": 132,
      "DISCH_THEN": 133,
      "FI": 134,
      "RST": 135,
      "FIRST": 136,
      "FF": 137,
      "SUFF": 138,
      "SUFF_TAC": 139,
      "REPEAT_STRIP_TAC": 140,
      "UN": 141,
      "X_ASSUM": 142,
      "_X_ASSUM": 143,
      "FIRST_X_ASSUM": 144,
      "X_": 145,
      "P_": 146,
      "SRW_TAC": 147,
      "ES": 148,
      "MES": 149,
      "ON_TAC": 150,
      "MESON_TAC": 151,
      "CAS": 152,
      "ONCE_ASM_REWRITE_TAC": 153,
      "ES_TAC": 154,
      "CASES_TAC": 155,
      "UNDISCH_TAC": 156,
      "EQ_TAC": 157,
      "X_GEN_TAC": 158,
      "REPEAT_GEN_TAC": 159,
      "AB": 160,
      "ER": 161,
      "AL": 162,
      "V_TAC": 163,
      "DE": 164,
      "M_TAC": 165,
      "SUB": 166,
      "DEP_": 167,
      "DEP_REWRITE_TAC": 168,
      "BRE": 169,
      "ABBRE": 170,
      "ABBREV_TAC": 171,
      "ASSUME_TAC": 172,
      "ASM_MESON_TAC": 173,
      "AP": 174,
      "ASM_CASES_TAC": 175,
      "PSET_TAC": 176,
      "AK": 177,
      "EAK": 178,
      "WEAK": 179,
      "WEAKEN_TAC": 180,
      "_TER": 181,
      "AP_TER": 182,
      "AP_TERM_TAC": 183,
      "GO": 184,
      "AL_THEN": 185,
      "SUBGO": 186,
      "SUBGOAL_THEN": 187,
      "R_TAC": 188,
      "FIRST_ASSUM": 189,
      "_o": 190,
      "_on": 191,
      "GEN": 192,
      "GEN_": 193,
      "EV": 194,
      "REWR_TAC": 195,
      "GEN_REWR_TAC": 196,
      "ARIT": 197,
      "H_TAC": 198,
      "ARITH_TAC": 199,
      "Ca": 200,
      "es": 201,
      "ses": 202,
      "Cases": 203,
      "Cases_on": 204,
      "STRIP_ASSUM": 205,
      "STRIP_ASSUME_TAC": 206,
      "1_TAC": 207,
      "UNABBREV_TAC": 208,
      "ERY": 209,
      "EVERY": 210,
      "AP_": 211,
      "MAP_": 212,
      "MAP_EVERY": 213,
      "_CASES_TAC": 214,
      "_ARITH_TAC": 215,
      "REAL": 216,
      "REAL_ARITH_TAC": 217,
      "D_CASES_TAC": 218,
      "COND_CASES_TAC": 219,
      "OO": 220,
      "SE_TAC": 221,
      "CHOO": 222,
      "CHOOSE_TAC": 223,
      "EL": 224,
      "X_CHOOSE_TAC": 225,
      "SUBST": 226,
      "DISJ": 227,
      "CT": 228,
      "A_TAC": 229,
      "BET": 230,
      "BETA_TAC": 231,
      "K_TAC": 232,
      "SUBST1_TAC": 233,
      "ND": 234,
      "OV": 235,
      "PR": 236,
      "OVE_TAC": 237,
      "PROVE_TAC": 238,
      "IM_TAC": 239,
      "_EL": 240,
      "_ELIM_TAC": 241,
      "ECT": 242,
      "SEL": 243,
      "ECT_ELIM_TAC": 244,
      "SELECT_ELIM_TAC": 245,
      "DISJ1_TAC": 246,
      "REPEAT_CONJ_TAC": 247,
      "_THM_TAC": 248,
      "AP_THM_TAC": 249,
      "ABS_TAC": 250,
      "AND": 251,
      "PAND": 252,
      "EXPAND": 253,
      "EXPAND_TAC": 254,
      "LE": 255,
      "RU": 256,
      "_ASSUM_TAC": 257,
      "LE_ASSUM_TAC": 258,
      "RULE_ASSUM_TAC": 259,
      "IND": 260,
      "UCT": 261,
      "INDUCT": 262,
      "INDUCT_TAC": 263,
      "REPEAT_POP_ASSUM": 264,
      "C_TAC": 265,
      "SPE": 266,
      "SPEC_TAC": 267,
      "2_TAC": 268,
      "DISJ2_TAC": 269,
      "ASM_REAL_ARITH_TAC": 270,
      "CONV_TAC": 271,
      "CCON": 272,
      "TR_TAC": 273,
      "CCONTR_TAC": 274,
      "_ALL_TAC": 275,
      "SUBST_ALL_TAC": 276,
      "In": 277,
      "ct": 278,
      "du": 279,
      "Indu": 280,
      "ct_on": 281,
      "Induct_on": 282,
      "_INDUCT_TAC": 283,
      "REPEAT_DISCH_THEN": 284,
      "BI": 285,
      "PAT": 286,
      "NOP_TAC": 287,
      "BINOP_TAC": 288,
      "PAT_ASSUM": 289,
      "SET_INDUCT_TAC": 290,
      "AL_TAC": 291,
      "EVAL_TAC": 292,
      "CI": 293,
      "DE_TAC": 294,
      "DECI": 295,
      "DECIDE_TAC": 296,
      "PU": 297,
      "RE_": 298,
      "REPEAT_RW_TAC": 299,
      "PURE_": 300,
      "LIST": 301,
      "SE_": 302,
      "SPO": 303,
      "T_THEN": 304,
      "NOT_THEN": 305,
      "REPEAT_DISCH_TAC": 306,
      "SE_NOT_THEN": 307,
      "SPOSE_NOT_THEN": 308,
      "M_LIST": 309,
      "ASSUM_LIST": 310,
      "T_TAC": 311,
      "POP_": 312,
      "POP_ASSUM_LIST": 313,
      "_CAS": 314,
      "REPEAT_COND_CASES_TAC": 315,
      "ES_THEN": 316,
      "DISJ_CAS": 317,
      "DISJ_CASES_THEN": 318,
      "REPEAT_FIRST_X_ASSUM": 319,
      "DISJ_CASES_TAC": 320,
      "HO": 321,
      "_MATCH_MP_TAC": 322,
      "HO_MATCH_MP_TAC": 323,
      "CE": 324,
      "PT_TAC": 325,
      "_t": 326,
      "ac": 327,
      "ACCE": 328,
      "REPEAT_AP_TERM_TAC": 329,
      "_tac": 330,
      "ACCEPT_TAC": 331,
      "PAT_": 332,
      "_EQ_TAC": 333,
      "et": 334,
      "REPEAT_MATCH_MP_TAC": 335,
      "PURE_REWRITE_TAC": 336,
      "PURE_ONCE_ASM_REWRITE_TAC": 337,
      "PAT_X_ASSUM": 338,
      "Li": 339,
      "mp": 340,
      "UNDISCH_THEN": 341,
      "Lib": 342,
      "C_INDUCT_TAC": 343,
      "ILL_TAC": 344,
      "KILL_TAC": 345,
      "N_EQ_TAC": 346,
      "SNO": 347,
      "rw": 348,
      "MATCH_ACCEPT_TAC": 349,
      "FUN_EQ_TAC": 350,
      "SNOC_INDUCT_TAC": 351,
      "rw_tac": 352,
      "AU": 353,
      "T_ELIM_TAC": 354,
      "TAU": 355,
      "co": 356,
      "eInduct_on": 357,
      "is": 358,
      "let": 359,
      "met": 360,
      "mLib": 361,
      "nu": 362,
      "AST_ELIM_TAC": 363,
      "ASM_ARITH_TAC": 364,
      "LEAST_ELIM_TAC": 365,
      "PURE_ONCE_REWRITE_TAC": 366,
      "mplet": 367,
      "TAUT_TAC": 368,
      "complet": 369,
      "is_tac": 370,
      "metis_tac": 371,
      "numLib": 372,
      "completeInduct_on": 373,
      "NET": 374,
      "_PROVE_TAC": 375,
      "imp": 376,
      "simp": 377,
      "NO_TAC": 378,
      "SET_EQ_TAC": 379,
      "REPEAT": 380,
      "REPEAT_EXISTS_TAC": 381,
      "NET_PROVE_TAC": 382,
      "simpLib": 383,
      "++": 384,
      "G_": 385,
      "RON": 386,
      "SER": 387,
      "`,": 388,
      "``,": 389,
      "ASSER": 390,
      "STRU": 391,
      "STRON": 392,
      "REPEAT_INDUCT_TAC": 393,
      "REPEAT_REPEAT": 394,
      "DEP_ONCE_REWRITE_TAC": 395,
      "GEN_MESON_TAC": 396,
      "EVERY_ASSUM": 397,
      "CT_CASES_TAC": 398,
      "LIST_INDUCT_TAC": 399,
      "REPEAT_SIMP_TAC": 400,
      "G_CONJ_TAC": 401,
      "ASSERT_TAC": 402,
      "STRUCT_CASES_TAC": 403,
      "STRONG_CONJ_TAC": 404
    },
    "merges": [
      "_ T",
      "A C",
      "_T AC",
      "P _TAC",
      "M P_TAC",
      "I S",
      "W _TAC",
      "A S",
      "I MP_TAC",
      "S IMP_TAC",
      "R W_TAC",
      "C H",
      "R I",
      "R E",
      "E T",
      "M _",
      "AS M_",
      "E _TAC",
      "RE W",
      "RI T",
      "REW RIT",
      "REWRIT E_TAC",
      "D IS",
      "DIS CH",
      "M ET",
      "IS _TAC",
      "MET IS_TAC",
      "A T",
      "L L",
      "S U",
      "E N",
      "DISCH _TAC",
      "O N",
      "S T",
      "M AT",
      "CH _",
      "MAT CH_",
      "MATCH_ MP_TAC",
      "AS SU",
      "ASSU M",
      "F U",
      "_ SIMP_TAC",
      "LL _SIMP_TAC",
      "FU LL_SIMP_TAC",
      "N O",
      "K NO",
      "KNO W_TAC",
      "_ ASSUM",
      "S _TAC",
      "ASM_ SIMP_TAC",
      "EN _TAC",
      "S ET",
      "ST RI",
      "SET _TAC",
      "G EN_TAC",
      "STRI P_TAC",
      "E X",
      "IS T",
      "EX IST",
      "EXIST S_TAC",
      "ASM_ REWRITE_TAC",
      "ASM_ SET_TAC",
      "E _",
      "P _ASSUM",
      "C E_",
      "ON CE_",
      "P E",
      "AT _",
      "RE PE",
      "REPE AT_",
      "C ON",
      "LL _TAC",
      "A LL_TAC",
      "P O",
      "PO P_ASSUM",
      "Q _TAC",
      "_T H",
      "_TH EN",
      "J _TAC",
      "CON J_TAC",
      "ONCE_ REWRITE_TAC",
      "DISCH _THEN",
      "F I",
      "R ST",
      "FI RST",
      "F F",
      "SU FF",
      "SUFF _TAC",
      "REPEAT_ STRIP_TAC",
      "U N",
      "X _ASSUM",
      "_ X_ASSUM",
      "FIRST _X_ASSUM",
      "X _",
      "P _",
      "S RW_TAC",
      "E S",
      "M ES",
      "ON _TAC",
      "MES ON_TAC",
      "C AS",
      "ONCE_ ASM_REWRITE_TAC",
      "E S_TAC",
      "CAS ES_TAC",
      "UN DISCH_TAC",
      "E Q_TAC",
      "X_ GEN_TAC",
      "REPEAT_ GEN_TAC",
      "A B",
      "E R",
      "A L",
      "V _TAC",
      "D E",
      "M _TAC",
      "SU B",
      "DE P_",
      "DEP_ REWRITE_TAC",
      "B RE",
      "AB BRE",
      "ABBRE V_TAC",
      "ASSUM E_TAC",
      "ASM_ MESON_TAC",
      "A P",
      "ASM_ CASES_TAC",
      "P SET_TAC",
      "A K",
      "E AK",
      "W EAK",
      "WEAK EN_TAC",
      "_T ER",
      "AP _TER",
      "AP_TER M_TAC",
      "G O",
      "AL _THEN",
      "SUB GO",
      "SUBGO AL_THEN",
      "R _TAC",
      "FIRST _ASSUM",
      "_ o",
      "_o n",
      "G EN",
      "GEN _",
      "E V",
      "REW R_TAC",
      "GEN_ REWR_TAC",
      "A RIT",
      "H _TAC",
      "ARIT H_TAC",
      "C a",
      "e s",
      "s es",
      "Ca ses",
      "Cases _on",
      "STRI P_ASSUM",
      "STRIP_ASSUM E_TAC",
      "1 _TAC",
      "UN ABBREV_TAC",
      "ER Y",
      "EV ERY",
      "A P_",
      "M AP_",
      "MAP_ EVERY",
      "_ CASES_TAC",
      "_ ARITH_TAC",
      "RE AL",
      "REAL _ARITH_TAC",
      "D _CASES_TAC",
      "CON D_CASES_TAC",
      "O O",
      "S E_TAC",
      "CH OO",
      "CHOO SE_TAC",
      "E L",
      "X_ CHOOSE_TAC",
      "SUB ST",
      "DIS J",
      "C T",
      "A _TAC",
      "B ET",
      "BET A_TAC",
      "K _TAC",
      "SUBST 1_TAC",
      "N D",
      "O V",
      "P R",
      "OV E_TAC",
      "PR OVE_TAC",
      "I M_TAC",
      "_ EL",
      "_EL IM_TAC",
      "E CT",
      "S EL",
      "ECT _ELIM_TAC",
      "SEL ECT_ELIM_TAC",
      "DISJ 1_TAC",
      "REPEAT_ CONJ_TAC",
      "_TH M_TAC",
      "AP _THM_TAC",
      "AB S_TAC",
      "A ND",
      "P AND",
      "EX PAND",
      "EXPAND _TAC",
      "L E",
      "R U",
      "_ASSUM _TAC",
      "LE _ASSUM_TAC",
      "RU LE_ASSUM_TAC",
      "I ND",
      "U CT",
      "IND UCT",
      "INDUCT _TAC",
      "REPEAT_ POP_ASSUM",
      "C _TAC",
      "S PE",
      "SPE C_TAC",
      "2 _TAC",
      "DISJ 2_TAC",
      "ASM_ REAL_ARITH_TAC",
      "CON V_TAC",
      "C CON",
      "T R_TAC",
      "CCON TR_TAC",
      "_ ALL_TAC",
      "SUBST _ALL_TAC",
      "I n",
      "c t",
      "d u",
      "In du",
      "ct _on",
      "Indu ct_on",
      "_ INDUCT_TAC",
      "REPEAT_ DISCH_THEN",
      "B I",
      "P AT",
      "NO P_TAC",
      "BI NOP_TAC",
      "PAT _ASSUM",
      "SET _INDUCT_TAC",
      "AL _TAC",
      "EV AL_TAC",
      "C I",
      "D E_TAC",
      "DE CI",
      "DECI DE_TAC",
      "P U",
      "RE _",
      "REPEAT_ RW_TAC",
      "PU RE_",
      "L IST",
      "S E_",
      "S PO",
      "T _THEN",
      "NO T_THEN",
      "REPEAT_ DISCH_TAC",
      "SE_ NOT_THEN",
      "SPO SE_NOT_THEN",
      "M_ LIST",
      "ASSU M_LIST",
      "T _TAC",
      "PO P_",
      "POP_ ASSUM_LIST",
      "_ CAS",
      "REPEAT_ COND_CASES_TAC",
      "ES _THEN",
      "DISJ _CAS",
      "DISJ_CAS ES_THEN",
      "REPEAT_ FIRST_X_ASSUM",
      "DISJ _CASES_TAC",
      "H O",
      "_ MATCH_MP_TAC",
      "HO _MATCH_MP_TAC",
      "C E",
      "P T_TAC",
      "_ t",
      "a c",
      "AC CE",
      "REPEAT_ AP_TERM_TAC",
      "_t ac",
      "ACCE PT_TAC",
      "P AT_",
      "_ EQ_TAC",
      "e t",
      "REPEAT_ MATCH_MP_TAC",
      "PURE_ REWRITE_TAC",
      "PURE_ ONCE_ASM_REWRITE_TAC",
      "PAT_ X_ASSUM",
      "L i",
      "m p",
      "UN DISCH_THEN",
      "Li b",
      "C _INDUCT_TAC",
      "I LL_TAC",
      "K ILL_TAC",
      "N _EQ_TAC",
      "S NO",
      "r w",
      "MATCH_ ACCEPT_TAC",
      "FU N_EQ_TAC",
      "SNO C_INDUCT_TAC",
      "rw _tac",
      "A U",
      "T _ELIM_TAC",
      "T AU",
      "c o",
      "e Induct_on",
      "i s",
      "l et",
      "m et",
      "m Lib",
      "n u",
      "AS T_ELIM_TAC",
      "ASM_ ARITH_TAC",
      "LE AST_ELIM_TAC",
      "PURE_ ONCE_REWRITE_TAC",
      "mp let",
      "TAU T_TAC",
      "co mplet",
      "is _tac",
      "met is_tac",
      "nu mLib",
      "complet eInduct_on",
      "N ET",
      "_ PROVE_TAC",
      "i mp",
      "s imp",
      "NO _TAC",
      "SET _EQ_TAC",
      "REPE AT",
      "REPEAT_ EXISTS_TAC",
      "NET _PROVE_TAC",
      "simp Lib",
      "+ +",
      "G _",
      "R ON",
      "S ER",
      "` ,",
      "` `,",
      "AS SER",
      "ST RU",
      "ST RON",
      "REPEAT_ INDUCT_TAC",
      "REPEAT_ REPEAT",
      "DEP_ ONCE_REWRITE_TAC",
      "GEN_ MESON_TAC",
      "EVERY _ASSUM",
      "CT _CASES_TAC",
      "LIST _INDUCT_TAC",
      "REPEAT _SIMP_TAC",
      "G_ CONJ_TAC",
      "ASSER T_TAC",
      "STRU CT_CASES_TAC",
      "STRON G_CONJ_TAC"
    ]
  }
}